
### a
"""
a.元素分类

有如下值集合
v1 = [11, 22, 33, 44, 55, 66, 77, 88, 99, 90]，
将所有大于
66
的值保存至字典的第一个key中，将小于
66
的值保存至第二个key的值中。
即： {'k1': 大于66的所有值, 'k2': 小于66的所有值}"""

#!/usr/bin/python
#-*- coding:utf-8 -*-
# v2 = {'k1': [], 'k2': []}
# v1 = [11,22,33,44,55,66,77,88,99,90]
# v2 = {}
# s_list = []
# l_list = []
# for each_a in v1:
#     if int(each_a) > 66:
#         s_list.append(each_a)
#         v2['k1'] = s_list
#     else:
#         l_list.append(each_a)
#         v2['k2'] = l_list
#
# print(v2)
#------------------------------------------------------#

### b
# """b.功能要求：
# v = 2000
# 要求用户输入总资产，例如：2000
# 显示商品列表，让用户根据序号选择商品，加入购物车
# 购买，如果商品总额大于总资产，提示账户余额不足，否则，购买成功。
# goods = [
#     {"name": "电脑", "price": 1999},
#     {"name": "鼠标", "price": 10},
#     {"name": "游艇", "price": 20},
#     {"name": "美女", "price": 998},
# ]
#
# num = input('>>>')  # 1
# num = int(num)
# goods[num]['price']"""


