#!/usr/bin/env python
# -*- coding:utf-8 -*-

import auth_user,shopping

# 登录界面
show="""
    #################################################
    ###############欢迎登录买你妹商城################
    ############这里可以买到所有你不想要的###########
    #################################################
"""
show_fuct="""
    ##############请按序号选择对应功能###############
    #1.进入购物商场
    #2.系统登录
    #3.信用卡中心
    #4.高级管理
    #5.退出系统
    #################################################
"""
show_fuct_store="""
    #################################################
    #1.查看商品列表
    #2.加入购物车
    #3.支付订单
    #4.退出商场
    #################################################
"""
show_fuct_system="""
    #################################################
    #1.修改密码
    #2.购物记录
    #3.查询余额
    #4.注销用户
    #################################################
"""
show_fuct_card="""
    #################################################
    #1.提现
    #2.转账
    #3.还款
    #4.退出信用卡
    #################################################
"""
show_fuct_setting=""""
    #################################################
    #1.创建用户
    #2.删除用户
    #3.信用卡办理
    #4.信用卡冻结
    #5.退出管理系统
    #################################################
"""



def show_fuct():
    menu_dic = {
        '1': in_shop,,
        '2': ,
        '3': remove,
        '4': exit,
    }


while True:
    user_in = input('操作>>:').strip()
    # if len(user_in) == 0 or user_in in menu_dic:continue
    # if user_in == '4':break
    if int(user_in) == 1:
        print(msg_fetch)
    elif int(user_in) == 2:
        print(msg_add)
    elif int(user_in) == 3:
        print(msg_del)
    elif int(user_in) == 4:
        exit()
    data = input("数据>>:").strip()


print(show)
# 用户登录
auth_user.user_login()

print(show_fuct)